import {
  bathIcon,
  furnitureIcon, moreIcon,
  shale1Img, shale2Img,
  shale3Img, shale4Img,
} from 'assets/images';

export const dataShales = [
  {
    id: 1,
    title: 'Двухместное шале №1',
    subtitle: 'VIP вариант с двумя спальнями. Аутентичная отделка из натурального камня и дерева, медная ванная ручной ковки и шикарный вид из окна на реку подарят вам эстетическое наслаждение.',
    subtitleView: 'Роскошное VIP шале для небольшой компании. Сруб из массива 300-летнего кедра с двумя спальнями и просторной зоной отдыха с камином.',
    subtitleSlider: 'Здесь можно насладиться тишиной и спокойствием. То самое место, где время останавливается для исполнения самых заветных желаний',
    people: 4,
    place: 120,
    photo: shale1Img,
    allAmList: [
      {
        id: 1,
        text: [
          'Мебель из кедра, сосны и карагача',
          'Две двуспальные кровати',
          'Ортопедические матрасы',
          'Мини-бар',
          'Чайная станция',
        ],
        icon: furnitureIcon,
      },
      {
        id: 2,
        text: [
          'Медные ванны ручной ковки',
          'Душ, туалет',
          'Бельевая комната',
          'Косметические наборы',
          'Халаты',
        ],
        icon: bathIcon,
      },
      {
        id: 3,
        text: [
          'Камин',
          'Сейф',
          'Wi-fi',
          'Тапочки',
          'Фен',
        ],
        icon: moreIcon,
      },
    ],
  },
  {
    id: 2,
    title: 'Двухместное шале №2',
    subtitle: 'Коттедж из 300-летнего Алтайского кедра. Две спальни с собственными ванными комнатами, большая гостиная с камином и натуральная отделка помогут погрузиться в мир роскоши и уюта.',
    subtitleView: 'Комфортабельное шале на берегу горной реки из кедрового бруса с двумя спальнями, индивидуальными ванными комнатами и просторной зоной отдыха.',
    subtitleSlider: 'Шале из срубов многовековых кедров сочетает в себе традиции народов и роскошь современности',
    people: 4,
    place: 120,
    photo: shale2Img,
    allAmList: [
      {
        id: 1,
        text: [
          'Мебель из кедра, сосны и карагача',
          'Две двуспальные кровати',
          'Ортопедические матрасы',
          'Мини-бар',
          'Чайная станция',
        ],
        icon: furnitureIcon,
      },
      {
        id: 2,
        text: [
          'Медные ванны ручной ковки',
          'Душ, туалет, биде',
          'Бельевая комната',
          'Косметические наборы',
          'Халаты',
        ],
        icon: bathIcon,
      },
      {
        id: 3,
        text: [
          'Камин',
          'Сейф',
          'Wi-fi',
          'Тапочки',
          'Фен',
        ],
        icon: moreIcon,
      },
    ],
  },
  {
    id: 3,
    title: 'Двухместное шале №3',
    subtitle: 'Комфортабельное шале для большой компании. Здесь есть всё для семейного, корпоративного отдыха или выездов с друзьями: 4 спальни, санузел с душем, просторная гостиная с камином.',
    subtitleView: 'Комфортный отдых в кругу близких людей. Четыре спальни с широкими кроватями и место притяжения для общения – просторная гостиная с камином.',
    subtitleSlider: 'Собраться большой компанией уютным вечером или покорить горы с друзьями. Шале станет основой вашего комфорта в окружении нетронутой природы Алтая',
    people: 8,
    place: 105,
    photo: shale3Img,
    allAmList: [
      {
        id: 1,
        text: [
          'Мебель из кедра, сосны и карагача',
          '4 кровати 160*200 см',
          'Ортопедические матрасы',
          'Обеденная зона',
        ],
        icon: furnitureIcon,
      },
      {
        id: 2,
        text: [
          'Душ, туалет',
          'Косметические наборы',
          'Халаты',
          'Тапочки',
          'Фен',
        ],
        icon: bathIcon,
      },
      {
        id: 3,
        text: [
          'Камин',
          'Мини-бар',
          'Чайная станция',
          'Сейф',
          'Wi-fi',
        ],
        icon: moreIcon,
      },
    ],
  },
  {
    id: 4,
    title: 'Двухместное шале №4',
    subtitle: 'Вместительное шале с 4 спальнями. Стены и мебель из натуральной древесины создают тёплую, уютную атмосферу, а природный камень на полу добавляет аутентичности пространству.',
    subtitleView: 'Шале из вековых деревьев, впитавших тепло солнца и частицу загадочного мистического Алтая.',
    subtitleSlider: 'Жизнь вдали от цивилизации может быть комфортной. Вас ждёт неповторимый Алтайский колорит в сочетании с современным дизайном. Натуральные материалы, просторные спальни, камин и сервис высшего уровня',
    people: 8,
    place: 105,
    photo: shale4Img,
    allAmList: [
      {
        id: 1,
        text: [
          'Мебель из кедра, сосны и карагача',
          '4 кровати 160*200 см',
          'Ортопедические матрасы',
          'Обеденная зона',
        ],
        icon: furnitureIcon,
      },
      {
        id: 2,
        text: [
          'Душ, туалет',
          'Косметические наборы',
          'Халаты',
          'Тапочки',
          'Фен',
        ],
        icon: bathIcon,
      },
      {
        id: 3,
        text: [
          'Камин',
          'Мини-бар',
          'Чайная станция',
          'Сейф',
          'Wi-fi',
        ],
        icon: moreIcon,
      },
    ],
  },
];
