import {
  shale1Img, shale2Img,
  shale3Img, shale4Img,
} from 'assets/images';

export const dataShales = [
  {
    id: 1,
    title: 'Двухместное шале №1',
    subtitle: 'VIP вариант с двумя спальнями. Аутентичная отделка из натурального камня и дерева, медная ванная ручной ковки и шикарный вид из окна на реку подарят вам эстетическое наслаждение.',
    people: 4,
    place: 120,
    photo: shale1Img,
  },
  {
    id: 2,
    title: 'Двухместное шале №2',
    subtitle: 'Коттедж из 300-летнего Алтайского кедра. Две спальни с собственными ванными комнатами, большая гостиная с камином и натуральная отделка помогут погрузиться в мир роскоши и уюта.',
    people: 4,
    place: 120,
    photo: shale2Img,
  },
  {
    id: 3,
    title: 'Двухместное шале №3',
    subtitle: 'Комфортабельное шале для большой компании. Здесь есть всё для семейного, корпоративного отдыха или выездов с друзьями: 4 спальни, санузел с душем, просторная гостиная с камином.',
    people: 8,
    place: 105,
    photo: shale3Img,
  },
  {
    id: 4,
    title: 'Двухместное шале №4',
    subtitle: 'Вместительное шале с 4 спальнями. Стены и мебель из натуральной древесины создают тёплую, уютную атмосферу, а природный камень на полу добавляет аутентичности пространству.',
    people: 8,
    place: 105,
    photo: shale4Img,
  },
];
